{"paperId": "ab44f307fbb99543c2954b815e805e63a28811f0", "title": "Light field-based face liveness detection with convolutional neural networks", "venue": "J. Electronic Imaging", "year": 2019, "openAccessPdf": {"url": "", "status": "CLOSED", "license": null, "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1117/1.JEI.28.1.013003?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1117/1.JEI.28.1.013003, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "authors": [{"authorId": "49354358", "name": "Mengyang Liu"}, {"authorId": "144977049", "name": "Hong Fu"}, {"authorId": "144230811", "name": "Ying Wei"}, {"authorId": "6260845", "name": "Yasar Abbas Ur Rehman"}, {"authorId": "144582405", "name": "L. Po"}, {"authorId": "2330090", "name": "W. Lo"}], "abstract": "Abstract. Face recognition based-access systems have been used widely in security systems as the recognition accuracy can be quite high. However, these systems suffer from low robustness to spoofing attacks. To achieve a reliable security system, a well-defined face liveness detection technique is crucial. We present an approach for this problem by combining data of the light-field camera (LFC) and the convolutional neural networks in the detection process. The LFC can detect the depth of an object by a single shot, from which we derive meaningful features to distinguish the spoofing attack from the real face, through a single shot. We propose two features for liveness detection: the ray difference images and the microlens images. Experimental results based on a self-built light-field imaging database for three types of the spoofing attacks are presented. The experimental results show that the proposed system gives a lower average classification error (0.028) as compared with the method of using hand-crafted features and conventional imaging systems. In addition, the proposed system can be used to classify the type of the spoofing attack."}
